/********************************************************************************************
* 类名称  ：UUid
* 基本功能：获取uuid
* 作    者：陈梦林
* 完成日期：2016年4月30日
*
* 更新历史：
* 1，更新时间：
*    更新内容：
*    作    者：
***********************************************************************************************/

#include "quuid.h"
#include "qstring.h"

class UUid
{
public:

	/*******************************************************************************************
	* 函数名称：getUUid
	* 函数介绍：获取uuid
	* 输入参数：无
	* 输出参数：uuid
	* 返回值  ：String
	********************************************************************************************/

	static QString getUUid()
	{
		QUuid uuid = QUuid::createUuid();
		return uuid.toString();
	}
};